In [2]:
import matplotlib.pyplot as plt
%matplotlib inline
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [3]:
#1.数据载入 usa_elect/contb_01.csv   02
#contb.shape
#contb.info()
#contb.head()
#contb.describe()

In [4]:
contb = DataFrame(np.random.randint(0,150,size=(7,5)))
contb

     0    1    2    3    4
0   28   50   73    5   74
1   11   71  124  101  123
2   35    2   75   54   78
3   63  135   62    9  113
4   28   61  145  103  106
5   56  104  125   58  113
6  139    8  114   84  112

In [5]:
contb.head()

    0    1    2    3    4
0  28   50   73    5   74
1  11   71  124  101  123
2  35    2   75   54   78
3  63  135   62    9  113
4  28   61  145  103  106

In [7]:
parties = {5:"nihao",73:"chen"}

In [8]:
#:数据映射: 
contb[2] = contb[3].map(parties)

In [9]:
contb

     0    1      2    3    4
0   28   50  nihao    5   74
1   11   71    NaN  101  123
2   35    2    NaN   54   78
3   63  135    NaN    9  113
4   28   61    NaN  103  106
5   56  104    NaN   58  113
6  139    8    NaN   84  112

In [10]:
contb[2].value_counts() #计数

nihao    1
Name: 2, dtype: int64

In [12]:
contb.groupby(3)[4].sum() #根据政党对金额进行划分;

3
5       74
9      113
54      78
58     113
84     112
101    123
103    106
Name: 4, dtype: int32